app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
  def index
    @admin_users = User.all.page(params[:page]).per(10)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @admin_user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
     @admin_user =  User.find(params[:id])

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "firstname", "lastname") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @admin_user = User.new(admin_user_params)

    respond_to do |format|
      if @admin_user.save

UPDATE "users" SET "firstname" = ?, "lastname" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["firstname", "sandra"], ["lastname", "tsai"], ["password_digest", "$2a$10$jaqMBTdxSDnj8HyU1kpBdOqxB8jbUIwdaBE2l2RiuZofE7GLzOrfG"], ["updated_at", 2016-08-17 17:47:18 UTC], ["id", 2]]
---
  def update
    if @admin_user.update(admin_user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 10]]
---
  def destroy
    UserMailer.deleted_email(@admin_user).deliver_now

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_admin_user
      @admin_user = User.find(params[:id])