app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 2]]
---
<p>Last name : <%= @user.lastname %></p>
<p> Posted reviews : <%  @user.reviews.each do |post| %></p>