app/controllers/movies_controller.rb

  def index
    if Movie.title(params[:title]).present?
---
SELECT "movies".* FROM "movies" WHERE (runtime_in_minutes > 90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120)

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("title", "director", "runtime_in_minutes", "description", "release_date", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])

    if @movie.update_attributes(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "ID documentation"], ["updated_at", 2016-08-17 16:14:33 UTC], ["id", 2]]