app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("user_id", "movie_id", "text", "rating_out_of_ten", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["movie_id", 4], ["text", "Amazing movie!"], ["rating_out_of_ten", 2], ["created_at", 2016-08-19 00:40:54 UTC], ["updated_at", 2016-08-19 00:40:54 UTC]]
---
  def create
    @review = @movie.reviews.build(review_params)
    @review.user_id = current_user.id

    if @review.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def load_movie
    @movie = Movie.find(params[:movie_id])